labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
      //TimeForSlowRunGPRS=HAL_GetTick();
    }
    
    
    

    //###########################################
    #endif
    //###########################################
    for(uint8_t i=0 ;i<sizeof(Sim80x.Gsm.HaveNewMsg) ; i++)
    {
      if(Sim80x.Gsm.HaveNewMsg[i] > 0)
      {
        //getSmsMsgMemorySts();        
        if(getSmsMsg(Sim80x.Gsm.HaveNewMsg[i])==true)
        {
					delay_ms(100);
          smsUserNewMsg(Sim80x.Gsm.MsgNumber,Sim80x.Gsm.MsgDate,Sim80x.Gsm.MsgTime,Sim80x.Gsm.Msg);
					delay_ms(100);
          deleteSmsMsg(Sim80x.Gsm.HaveNewMsg[i]);
					delay_ms(100);
        }
        getSmsMsgMemorySts();  
        Sim80x.Gsm.HaveNewMsg[i]=0;
      }        
    }    
    //###########################################
    if(Sim80x.Gsm.MsgUsed > 0)
    {   
      if(getSmsMsg(UnreadMsgCounter)==true)
      {
        smsUserNewMsg(Sim80x.Gsm.MsgNumber,Sim80x.Gsm.MsgDate,Sim80x.Gsm.MsgTime,Sim80x.Gsm.Msg);
        deleteSmsMsg(UnreadMsgCounter);
        getSmsMsgMemorySts();
      }
      UnreadMsgCounter++;
      if(UnreadMsgCounter==150)
        UnreadMsgCounter=0;      
    }
    //###########################################
    if(Sim80x.Gsm.HaveNewCall == 1)
    {
      Sim80x.Gsm.GsmVoiceStatus = GsmVoiceStatus_Ringing;
      Sim80x.Gsm.HaveNewCall = 0;
     }    
    //###########################################
    //if(HAL_GetTick() - TimeForSlowRun > 20000)
    {
      sim800c.sendAtCommand("AT+CSQ\r\n",200,1,"\r\n+CSQ:");  
      sim800c.sendAtCommand("AT+CBC\r\n",200,1,"\r\n+CBC:"); 
      sim800c.sendAtCommand("AT+CREG?\r\n",200,1,"\r\n+CREG:");  
      getSmsMsgMemorySts();      
      //TimeForSlowRun=HAL_GetTick();
    }
    //###########################################
    //Gsm_User(HAL_GetTick());
    //###########################################
    delay_ms(100);
    
  }    
}

/****************************************************************
*FUNCTION NAME:setAtMode
*FUNCTION     :setAtMode
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setAtMode(void)
{
  uint8_t answer;

  delay_ms(1000);       // prerequisite for switching to At Command Mode
  answer = sim800c.sendAtCommand("+++\r\n",200, 0);
  delay_ms(1000);     // prerequisite for switching to At Command Mode

  debugTerminal("Sim80x_setAtMode");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;
}

/****************************************************************
*FUNCTION NAME:setDataMode
*FUNCTION     :setDataMode
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setDataMode(void)
{
  uint8_t answer;  

  delay_ms(1000);       // prerequisite for switching to Data Command Mode
  answer = sim800c.sendAtCommand("ATO\r\n",200, 0);

  debugTerminal("Sim80x_setDataMode");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setActiveProfile
*FUNCTION     :setActiveProfile
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setActiveProfile(void)
{
  uint8_t answer;

  // write your code here

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setDefaultConfig
*FUNCTION     :setDefaultConfig
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setDefaultConfig(void)
{
  uint8_t answer;

  answer = sim800c.sendAtCommand("ATZ\r\r",200, 0);

  debugTerminal("Sim80x_setDefaultConfig");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setFactoryDefault
*FUNCTION     :setFactoryDefault
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setFactoryDefault(void)
{
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT&F0\r\n",200,0);

  debugTerminal("Sim80x_setFactoryDefault");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setAtEcho
*FUNCTION     :change command echo mode
*INPUT        :turnon
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setAtEcho(bool turnon)
{
  char temp[20];
  uint8_t answer;

  snprintf(temp, sizeof(temp), "ATE%d\r\n", turnon); 
  answer = sim800c.sendAtCommand(temp, 200, 0);

  debugTerminal("Sim80x_setAtEcho");//need to check as response changes can be on or off
    
  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;


}

/****************************************************************
*FUNCTION NAME:setBaudRate
*FUNCTION     :AT command to change baud rate
*INPUT        :baudrate
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setBaudRate(uint16_t baudrate)
{  
  uint8_t answer;
  char temp[20];

  snprintf(temp, sizeof(temp), "AT+IPR=%d\r\n", baudrate); 
  answer = sim800c.sendAtCommand(temp, 200, 0);

  debugTerminal("Sim80x_setBaudRate");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

