labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setPower
*FUNCTION     :setPower
*INPUT        :turnon
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::setPower(bool turnon)
{ 
  if(turnon==true)
  {  
    if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
    {
      delay_ms(100);
      #if (_SIM80X_DEBUG==1)
      printf("\r\nSim80x_SetPower(ON) ---> OK\r\n");
      #endif
      Sim80x.Status.Power=1;
      //initValue();
    }
    else
    {     
      #if (_SIM80X_USE_POWER_KEY==1)  
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_RESET);
      delay_ms(1200);
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_SET);
      #endif
      delay_ms(3000);  
      if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
      {
        delay_ms(10000);
        #if (_SIM80X_DEBUG==1)
        printf("\r\nSim80x_SetPower(ON) ---> OK\r\n");
        #endif
        Sim80x.Status.Power=1;
        //initValue();   
      }
      else
        Sim80x.Status.Power=0;
    }
  }
  else
  {
    if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
    {
      #if (_SIM80X_DEBUG==1)
      printf("\r\nSim80x_SetPower(OFF) ---> OK\r\n");
      #endif
      Sim80x.Status.Power=0;
      #if (_SIM80X_USE_POWER_KEY==1) 
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_RESET);
      delay_ms(1200);
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_SET);
      #endif
      #if (_SIM80X_USE_POWER_KEY==0)
      sim800c.sendAtCommand("AT+CPOWD=1\r\n",2000,1,"\r\nOK\r\n"); 
      #endif      
    }
  }  
}

/****************************************************************
*FUNCTION NAME:saveParameters
*FUNCTION     :saveParameters
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool   LIB_SIM800C::setParameters(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT&W0\r\n",200,1,"AT&W0\r\r\nOK\r\n");

  debugTerminal("Sim80x_setParameters()");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getManNo
*FUNCTION     :getManNo 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getManNo(void)
{  
  uint8_t  answer;

  answer =sim800c.sendAtCommand("AT+CGMI\r\n",200,0);

  debugTerminal("Sim80x_getManNo");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;
}

/****************************************************************
*FUNCTION NAME:getModelNo
*FUNCTION     :getModelNo 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getModelNo(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+CGMM\r\n", 200, 0);

  debugTerminal("Sim80x_getModelNo");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;
  
}

/****************************************************************
*FUNCTION NAME:getGlobalNo
*FUNCTION     :getGlobalNo 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getGlobalNo(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+GOI\r\n", 200, 0);

  debugTerminal("Sim80x_getGlobalNo");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

  
}

/****************************************************************
*FUNCTION NAME:getLastCommand
*FUNCTION     :getLastCommand 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getLastCommand(void)
{     
  uint8_t answer;

  answer = sim800c.sendAtCommand("A/\r\n",200, 0);

  debugTerminal("Sim80x_getLastCommand");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;
}

/****************************************************************
*FUNCTION NAME:getCurrentConfig
*FUNCTION     :getCurrentConfig 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getCurrentConfig(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT&V0\r\n", 200, 0);

  debugTerminal("Sim80x_setFactoryDefault");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

    if(answer == 1)
    return true;
  else
    return false;
}

/****************************************************************
*FUNCTION NAME:getTaCapabilities
*FUNCTION     :getTaCapabilities 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getTaCapabilities(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+GCAP\r\n", 200, 0);

  debugTerminal("Sim80x_getTaCapabilities");
  
  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getIMEI
*FUNCTION     :recieve module IMEI number 
*INPUT        :IMEI
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getIMEI(char *IMEI)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+CGSN\r\n", 200, 0);

