labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
  debugTerminal("Sim80x_getIMEI");
 
  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));
  
  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getTeChar
*FUNCTION     :getTeChar 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getTeChar(void)
{  
  uint8_t answer;
 
  answer = sim800c.sendAtCommand("AT+CSCS?\r\n",200, 0);

  debugTerminal("Sim80x_getTeChar");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getAddrsType
*FUNCTION     :getAddrsType 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getAddrsType(void)
{
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+CSTA?\r\n",200, 0);

  debugTerminal("Sim80x_getAddrsType");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));
  
  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getIMSI
*FUNCTION     :getIMSI 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getIMSI(void)
{
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+CIMI\r\n",200,0);

  debugTerminal("Sim80x_getIMSI");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getOperator
*FUNCTION     :getOperator
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getOperator(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+COPS?\r\n",120000, 0);

  debugTerminal("Sim80x_getOperator");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getNetworkReg
*FUNCTION     :getNetworkReg 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getNetworkReg(void)
{
  uint8_t  answer;

  answer =sim800c.sendAtCommand("AT+CREG?\r\n",200, 0);

  debugTerminal("Sim80x_getNetworkReg");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;
}

/****************************************************************
*FUNCTION NAME:getRLPParams
*FUNCTION     :getRLPParams
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::getRLPParams(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+CRLP?\r\n",200, 0);

  debugTerminal("Sim80x_setRLPParams");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getCSQ
*FUNCTION     :getCSQ 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getCSQ(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+CSQ\r\n",200, 0);

  debugTerminal("Sim80x_getCSQ");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getPrefOperLst
*FUNCTION     :getPrefOperLst 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getPrefOperLst(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+CPOL?\r\n",200, 0);

  debugTerminal("Sim80x_getPrefOperLst");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getOperName
*FUNCTION     :getOperName 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getOperName(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+COPN\r\n",200, 0);

  debugTerminal("Sim80x_getOperName");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getPhoneFunc
*FUNCTION     :getPhoneFunc 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getPhoneFunc(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+CFUN?\r\n",10000, 0);

  debugTerminal("Sim80x_getPhoneFunc");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getClockData
*FUNCTION     :getClockData
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::getClockData(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+CCLK?\r\n",200, 0);

  debugTerminal("Sim80x_setClockData");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

