labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
    if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:getBattChar
*FUNCTION     :getBattChar 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::getBattChar(void)
{  
  uint8_t answer;

  answer = sim800c.sendAtCommand("AT+CBC\r\n",200, 0);

  debugTerminal("Sim80x_getBattChar");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setTeChar
*FUNCTION     :setTeChar
*INPUT        :chset
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setTeChar(char *chset)
{
  uint8_t answer;
  char temp[20];

  snprintf(temp, sizeof(temp), "AT+CSCS%s\r\n", chset);
  answer = sim800c.sendAtCommand(temp, 200, 0);

  debugTerminal("Sim80x_setTeChar");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setAddrsType
*FUNCTION     :setAddrsType
*INPUT        :type
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setAddrsType(uint8_t type)
{
  char temp[20];
  uint8_t answer;

  snprintf(temp, sizeof(temp), "AT+CSTA=%d\r\n", type); 
  answer = sim800c.sendAtCommand(temp,200, 0);

  debugTerminal("Sim80x_setAddrsType");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setSelOperator
*FUNCTION     :setSelOperator
*INPUT        :mode, format, oper
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setSelOperator(uint8_t mode, uint8_t format, uint8_t oper)
{
  char temp[20];
  uint8_t answer;

  snprintf(temp, sizeof(temp), "AT+COPS=%d,[%d[],%d]]\r\n", mode, format, oper); 
  answer = sim800c.sendAtCommand(temp,120000, 0);

  debugTerminal("Sim80x_setSelOperator");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setNetworkReg
*FUNCTION     :setNetworkReg
*INPUT        :turnon
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setNetworkReg(bool turnon)
{
  char temp[20];  
  uint8_t answer;

  snprintf(temp, sizeof(temp), "AT+CREG=%d\r\n", turnon); 
  answer = sim800c.sendAtCommand(temp,200, 0);

  debugTerminal("Sim80x_setNetworkReg");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setRLPParams
*FUNCTION     :setRLPParams 
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool  LIB_SIM800C::setRLPParams(uint16_t iws,uint16_t mws,uint16_t t2,uint16_t n2,uint16_t t4)
{
  char temp[20];  
  uint8_t answer;

  snprintf(temp, sizeof(temp), "AT+CRLP=%d[,%d[,%d[,%d[,%d]]]]\r\n", iws, mws, t2, n2, t4); 
  answer = sim800c.sendAtCommand(temp,200, 0);

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setPrefOperLst
*FUNCTION     :setPrefOperLst
*INPUT        :index, format, oper
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setPrefOperLst(uint8_t index, uint8_t  format, char *oper)
{
  char temp[20];
  uint8_t answer;

  snprintf(temp, sizeof(temp), "AT+CPOL=%d[,%d,%s]\r\n", index, format, oper); 
  answer = sim800c.sendAtCommand(temp,200, 0);

  debugTerminal("Sim80x_setPrefOperLst");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setPhoneFunc
*FUNCTION     :setPhoneFunc
*INPUT        :fun, rst
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::setPhoneFunc(uint8_t fun, uint8_t  rst)
{
  char temp[20];
  uint8_t answer;

  snprintf(temp, sizeof(temp), "AT+CFUN=%d[,%d]\r\n", fun, rst); 
  answer = sim800c.sendAtCommand(temp,10000, 0);

  debugTerminal("Sim80x_setPhoneFunc");
  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setClockData
*FUNCTION     :setClockData 
*INPUT        :void
*OUTPUT       :time
****************************************************************/
bool  LIB_SIM800C::setClockData(char *time)
{
  char temp[40];  
  uint8_t answer;

  snprintf(temp, sizeof(temp), "AT+CCLK=%s\r\n", time); 
  answer = sim800c.sendAtCommand(temp,200, 0);

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

  if(answer == 1)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:setSimAccess
*FUNCTION     :setSimAccess
*INPUT        :void
*OUTPUT       :length, command
****************************************************************/
bool LIB_SIM800C::setSimAccess(uint16_t length, char command)
{
  char temp[20];
  uint8_t answer;

  snprintf(temp, sizeof(temp), "AT+CSIM=%d,%s\r\n", length, command); 
  answer = sim800c.sendAtCommand(temp,200, 0);

  debugTerminal("Sim80x_setSimAccess");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand));

