labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
  if(answer == 1)
    return true;
  else
    return false;

}



/****************************************************************
*FUNCTION NAME:processManNo
*FUNCTION     :processManNo
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processManNo(uint16_t addrs)
{	
  char      *strStart,*str1;

  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
      
  str1 = strstr(strStart,"AT+CGMI\r\r\n");

  if(str1!=NULL)
    sscanf(str1,"AT+CGMI\r\r\n%s",Sim80x.IMEI);

  debugTerminal("Sim80x_getManNo");

  if(str1!=NULL)
    return true;
  else
    return false;   

}

/****************************************************************
*FUNCTION NAME:processModelNo
*FUNCTION     :processModelNo
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processModelNo(uint16_t addrs)
{	
  char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
      
  str1 = strstr(strStart,"AT+CGMM\r\r\n");

  if(str1!=NULL)
    sscanf(str1,"AT+CGMM\r\r\n%s",Sim80x.IMEI);
    
  debugTerminal("Sim80x_getModelNo");

  if(str1!=NULL)
    return true;
  else
    return false; 
	
}

/****************************************************************
*FUNCTION NAME:processGlobalNo
*FUNCTION     :processGlobalNo
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processGlobalNo(uint16_t addrs)
{	
  char      *strStart,*str1;

  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
      
  str1 = strstr(strStart,"AT+GOI\r\r\n");

  if(str1!=NULL)
    sscanf(str1,"AT+GOI\r\r\n%s",Sim80x.IMEI);
    
  debugTerminal("Sim80x_getGlobalNo");

  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processLastCommand
*FUNCTION     :processLastCommand
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processLastCommand(uint16_t addrs)
{	
  char      *strStart,*str1;

  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
      
  str1 = strstr(strStart,"A/\r\r\n");

  if(str1!=NULL)
    sscanf(str1,"A/\r\r\n%s",Sim80x.IMEI);

  debugTerminal("Sim80x_getLastCommand");

  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processCurrentConfig
*FUNCTION     :processCurrentConfig
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processCurrentConfig(uint16_t addrs)
{	
  char      *strStart,*str1;

  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
      
  str1 = strstr(strStart,"AT&V0\r\r\n");

  if(str1!=NULL)
    sscanf(str1,"AT&V0\r\r\n%s",Sim80x.IMEI);
    
  debugTerminal("Sim80x_getCurrentConfig");

  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processTaCapabilities(uint16_t addrs)
{	
  char      *strStart,*str1;

  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
      
  str1 = strstr(strStart,"AT+GCAP\r\r\n");

  if(str1!=NULL)
    sscanf(str1,"AT+GCAP\r\r\n%s",Sim80x.IMEI);

  debugTerminal("Sim80x_getTaCapabilities");

  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processNetworkReg
*FUNCTION     :processNetworkReg
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processNetworkReg(uint16_t addrs)
{
  char      *strStart, *str1;

  strStart = (char*)&Sim80x.UsartRxBuffer[0];  

  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processCSQ
*FUNCTION     :processCSQ
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processCSQ(uint16_t addrs)
{
  char      *strStart,*str1;

  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  str1 = strstr(strStart,"\r\n+CREG:");

  if(str1!=NULL)
  {
    str1 = strchr(str1,',');
    str1++;
    if(atoi(str1)==1)
      Sim80x.Status.RegisterdToNetwork=1;
    else
      Sim80x.Status.RegisterdToNetwork=0;
  }

  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processCBC
*FUNCTION     :processCBC
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processCBC(uint16_t addrs)
{
  
  char      *strStart,*str1;
  uint32_t tmp_int32_t;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  
  str1 = strstr(strStart,"\r\n+CBC:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    tmp_int32_t = atoi(str1);
    if(tmp_int32_t==0)
    {
      Sim80x.Status.BatteryCharging=0;
      Sim80x.Status.BatteryFull=0;
    }
    if(tmp_int32_t==1)
    {
      Sim80x.Status.BatteryCharging=1;
      Sim80x.Status.BatteryFull=0;
    }
    if(tmp_int32_t==2)
    {
      Sim80x.Status.BatteryCharging=0;
      Sim80x.Status.BatteryFull=1;
    }
    str1 = strchr(str1,',');
    str1++;
    Sim80x.Status.BatteryPercent = atoi(str1);
    str1 = strchr(str1,',');
    str1++;
    Sim80x.Status.BatteryVoltage = atof(str1)/1000;      
  }

 if(str1!=NULL)
    return true;
  else
    return false;

