labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
}

/****************************************************************
*FUNCTION NAME:processBTPair
*FUNCTION     :processBTPair
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processBTPair(uint16_t addrs)
{
  
  char      *strStart,*str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
   //##################################################  
  str1 = strstr(strStart,"\r\n+BTPAIR:");
  if(str1!=NULL)
  {
    
  }
 

  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processBTVisibility
*FUNCTION     :processBTVisibility
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processBTVisibility(uint16_t addrs)
{
  
  char      *strStart,*str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0]; 
  //##################################################  
  str1 = strstr(strStart,"\r\n+BTVIS:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    Sim80x.Bluetooth.Visibility=atoi(str1);
  }
   
  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processGPRSNetApn
*FUNCTION     :processGPRSNetApn
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processGPRSNetApn(uint16_t addrs)
{
  
  char      *strStart,*str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
   //##################################################  
  str1 = strstr(strStart,"\r\n+CSTT:");
  if(str1!=NULL)
  {
    sscanf(str1,"\r\n+CSTT: \"%[^\"]\",\"%[^\"]\",\"%[^\"]\"\r\n",Sim80x.GPRS.APN,Sim80x.GPRS.APN_UserName,Sim80x.GPRS.APN_Password);    
  }

 if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processGPRSNetLocalIP
*FUNCTION     :processGPRSNetLocalIP
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processGPRSNetLocalIP(uint16_t addrs)
{
  
  char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];
  //##################################################  
  str1 = strstr(strStart,"AT+CIFSR\r\r\n");
  if(str1!=NULL)
  {
    sscanf(str1,"AT+CIFSR\r\r\n%[^\r]",Sim80x.GPRS.LocalIP);
  } 
    
  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processGPRSNetMultiConnection
*FUNCTION     :processGPRSNetMultiConnection
*INPUT        :addrs 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processGPRSNetMultiConnection(uint16_t addrs)
{
  
  char      *strStart, *str1;
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  

//##################################################  
  str1 = strstr(strStart,"\r\n+CIPMUX:");
  if(str1!=NULL)
  {
    str1 =strchr(str1,':');
    str1++;
    if(atoi(str1)==0)
      Sim80x.GPRS.MultiConnection=0;
    else
      Sim80x.GPRS.MultiConnection=1;
  } 
  
  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processIMEI
*FUNCTION     :processIMEI
*INPUT        :addrs
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processIMEI(uint16_t addrs)
{
  char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+CGSN\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+CGSN\r\r\n%s",Sim80x.IMEI);

  debugTerminal("Sim80x_getIMEI");
  
}
 
/****************************************************************
*FUNCTION NAME:processHttpData
*FUNCTION     :processHttpData
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processHttpData(void)
{
  char      *strStart,*str1;

  strStart = (char*)&Sim80x.UsartRxBuffer[0];

  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processHttpAction
*FUNCTION     :processHttpAction
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processHttpAction(void)
{
  char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];

  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processHttpRead
*FUNCTION     :processHttpRead
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processHttpRead(void)
{
  char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];

  if(str1!=NULL)
    return true;
  else
    return false;

}

/****************************************************************
*FUNCTION NAME:processHttpContent
*FUNCTION     :processHttpContent
*INPUT        :void
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processHttpContent(void)
{
  char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];

  if(str1!=NULL)
    return true;
  else
    return false;
}



#endif

#endif
